{
    "items": [
        {
            "name": "Present Tense",
            "children": [
                {
                    "name": "Simple Present",
                    "children": [
                        {
                            "information": "Used to describe habits, unchanging situations, general truths, and fixed arrangements. The simple present tense is simple to form. Just use the base form of the verb",
                            "example": "(I take, you take, we take, they take) The 3rd person singular takes an -s at the end. (he takes, she takes)"
                        }
                    ]
                },
                {
                    "name": "Present Continuous",
                    "children": [
                        {
                            "information": "Used for actions happening now or for an action that is unfinished. This tense is also used when the action is temporary.",
                            "example": "Aunt Christine is 'warming' up the car while Scott looks for his new leather coat."
                        }
                    ]
                },
                {
                    "name": "Present Perfect",
                    "children": [
                        {
                            "information": "Used to show that an action has taken place once or many times before now.The present perfect is formed using has/have + past participle. ",
                            "example": "'Have' you 'seen' that movie many times?"
                        }
                    ]
                },
                {
                    "name": "Present Perfect Continuous",
                    "children": [
                        {
                            "information": "Used to refer to an unspecified time between 'before now' and 'now'. . The present perfect continuous is formed using the construction has/have been + the present participle (root + -ing).",
                            "example": "I 'have been reading' War and Peace for a month now."
                        }
                    ]
                }
                        ]
        },
        {
            "name": "Past Tense",
            "children": [
                {
                    "name": "Simple Past",
                    "children": [
                        {
                            "information": "The simple past is a verb tense that is used to talk about things that happened or existed before now. ",
                            "example": "He 'won' the silver medal."
                        }
                    ]
                },
                {
                    "name": "Past Continuous",
                    "children": [
                        {
                            "information": "The past continuous describes actions or events in a time before now, which began in the past and is still going on at the time of speaking.",
                            "example": "They 'were waiting' for the bus when the accident happened."
                        }
                    ]
                },
                {
                    "name": "Past Perfect",
                    "children": [
                        {
                            "information": "The past perfect refers to a time earlier than before now. It is used to make it clear that one event happened before another in the past.",
                            "example": "John 'had gone' out"
                        }
                    ]
                },
                {
                    "name": "Past Perfect Continuous",
                    "children": [
                        {
                            "information": "Used to refer to an unspecified time between 'before now' and 'now'. . The present perfect continuous is formed using the construction has/have been + the present participle (root + -ing).",
                            "example": "Martha 'had been walking' three miles a day before she broke her leg.."
                        }
                    ]
                }
                        ]
        },
        {
            "name": "Future Tense",
            "children": [
                {
                    "name": "Simple Future",
                    "children": [
                        {
                            "information": "The past perfect continuous tense is constructed using had been + the verb’s present participle (root + -ing).",
                            "example": "Jen is <bold>not going to quit</bold> before she reaches her goal."
                        }
                    ]
                },
                {
                    "name": "Future Continuous",
                    "children": [
                        {
                            "information": "The simple future tense is a verb tense that is used when an action is expected to occur in the future and be completed.It is formed using the construction will + be + the present participle (the root verb + -ing). ",
                            "example": "I 'will be stressed' tomorrow during my science test."
                        }
                    ]
                },
                {
                    "name": "Future Perfect",
                    "children": [
                        {
                            "information": "The future perfect is a verb tense used for actions that will be completed before some other point in the future. ",
                            "example": "'You will have finished' your report by this time next week."
                        }
                    ]
                },
                {
                    "name": "Future Perfect Continuous",
                    "children": [
                        {
                            "information": "The future perfect continuous, also sometimes called the future perfect progressive, is a verb tense that describes actions that will continue up until a point in the future. The future perfect continuous consists of will + have + been + the verb’s present participle (verb root + -ing).",
                            "example": "She 'is going to have been working' at that company for three years when it finally closes."
                        }
                    ]
                }
                        ]
        }
       
    ]
}